Support for mermaid.
