--- a/2550_algo_output_iterator/algo-output-iterator.md
+++ b/2550_algo_output_iterator/algo-output-iterator.md
@@ -93,34 +97,22 @@ Or, in graph form:
 
 ::: bq
 ```mermaid
-graph TD;
-  A-->B;
-  A-->C;
-  B-->D;
-  C-->D;
-```
+%%{init: {'themeVariables': { 'fontFamily': 'Monospace', 'fontSize': '9px'}}}%%
+graph LR
+    A[output_iterator&ltO, T&gt] --> B["*out++ = std::forward&ltT&gt(t);"];
+    A --> C[input_or_output_iterator&ltO&gt];
+    A --> D[indirectly_writable&ltO, T&gt];
 
-```{.graphviz caption="output iterator concept hierarchy"}
-digraph G {
-    rankdir="TB"
-    node [fontname = "consolas"];
-    overlap=false;
-    size="8.5,8.5";
 
-    "output_iterator<O, T>" -> "*o++ = std::forward<T>(t);";
-    "output_iterator<O, T>" -> "input_or_output_iterator<O>";
-    "output_iterator<O, T>" -> "indirectly_writable<O, T>";
+    C --> G[weakly_incrementable&ltO&gt];
+    C --> H["*o;"];
 
-    "input_iterator<I>" -> "indirectly_readable<I>";
+    I[indirectly_copyable&ltI, O&gt] --> J[indirectly_readable&ltI&gt];
+    I --> D;
 
-    "input_or_output_iterator<O>" -> "weakly_incrementable<O>";
-    "input_or_output_iterator<O>" -> "*o;";
+    E[input_iterator&ltI&gt] --> J;
 
-    "indirectly_copyable<I, O>" -> "indirectly_readable<I>";
-    "indirectly_copyable<I, O>" -> "indirectly_writable<O, T>";
-
-    "indirectly_writable<O, T>" -> "*o;";
-}
+    D --> H;
 ```
 :::
 
